app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params[:comment])
    @comment.post = @post
    if @comment.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
INSERT INTO `comments` (`created_at`, `author`, `body`, `updated_at`, `post_id`) VALUES('2010-06-10 16:25:20', 'sdfg', 'sdfg', '2010-06-10 16:25:20', 4)