app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])                       #new post object from the form.
    if @post.save                                         #tries to save the post then uses the result as a bool.
      flash[:notice] = 'Your post was saved successfully.'#sets a temporary flash message
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2010-06-09 18:27:59', 'Firs blog post', 'Wow, I spelled \'first\' wrong!', '2010-06-09 18:27:59')

  def update
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 11)